Revit 2026 API

# WallCreate(Document, IListCurve, ElementId, ElementId, Boolean, XYZ) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Wall Create(
	Document document,
	IList<Curve> profile,
	ElementId wallTypeId,
	ElementId levelId,
	bool structural,
	XYZ normal
)
```
```vb
Public Shared Function Create (
	document As Document,
	profile As IList(Of Curve),
	wallTypeId As ElementId,
	levelId As ElementId,
	structural As Boolean,
	normal As XYZ
) As Wall
```
```cpp
public:
static Wall^ Create(
	Document^ document,
	IList<Curve^>^ profile,
	ElementId^ wallTypeId,
	ElementId^ levelId,
	bool structural,
	XYZ^ normal
)
```
```fsharp
static member Create :
        document : Document *
        profile : IList<Curve> *
        wallTypeId : ElementId *
        levelId : ElementId *
        structural : bool *
        normal : XYZ -> Wall
```

#### Parameters

document Document

profile IListCurve

wallTypeId ElementId

levelId ElementId

structural Boolean

normal XYZ

#### Return Value

Wall

#### Reference

Wall Class

Create Overload

Autodesk.Revit.DB Namespace